НВ_Доработки/Enums/НВД_ВидыОтгрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>НВД_ВидыОтгрузки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Доставка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоставкаСоСкладаПартнера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Самовывоз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоставкаТК</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

НВ_Доработки/Documents/ЗаявкаНаДоставку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаявкаНаДоставку</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НВД_КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СтоимостьДоставки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОплачиваетПолучатель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоставленоОтветственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВодительЗаберетГрузСамостоятельно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Результат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыЗаявокНаДоставку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтправленоДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УДАЛИТЬ_Основание</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоставленоДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Город</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Города</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОжидаемаяДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОжидаемаяДатаДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Экспедитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СпособДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыДоставкиТовара</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>авто_ТелефонВодителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерОтправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>авто_Модель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>авто_Марка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтветственныйЗаДоставку</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>авто_ГосНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>авто_Водитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтправленоОтветственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаЗатратНаДоставку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТелефонКонтактногоЛица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтправленEMail</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидТранспортногоСредства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыТранспортныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Основание</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Основания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Основание</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

НВ_Доработки/CommonModules/НВД_ОбработчикиСобытий/Ext/Module.bsl
Процедура НВД_ПередЗаписьюЗаказПокупателя(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	//Очистим значения не используемых полей
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("НВД_ВидОтгрузки", Источник.Метаданные()) Тогда
		Если Источник.НВД_ВидОтгрузки = Перечисления.НВД_ВидыОтгрузки.Доставка Тогда
			Если ОбщегоНазначения.ЕстьРеквизитОбъекта("НВД_АдресПартнера", Источник.Метаданные()) Тогда
				Источник.НВД_АдресПартнера = "";
			КонецЕсли;
			Если ОбщегоНазначения.ЕстьРеквизитОбъекта("НВД_ДопИнфоАдресПартнера", Источник.Метаданные()) Тогда
				Источник.НВД_ДопИнфоАдресПартнера = "";
			КонецЕсли;
			Если ОбщегоНазначения.ЕстьРеквизитОбъекта("НВД_ДатаСамовывоза", Источник.Метаданные()) Тогда
				Источник.НВД_ДатаСамовывоза = "";
			КонецЕсли;
			Если ОбщегоНазначения.ЕстьРеквизитОбъекта("НВД_ВремяСамовывоза", Источник.Метаданные()) Тогда
				Источник.НВД_ВремяСамовывоза = "";
			КонецЕсли;
		ИначеЕсли Источник.НВД_ВидОтгрузки = Перечисления.НВД_ВидыОтгрузки.Самовывоз ИЛИ Источник.НВД_ВидОтгрузки = Перечисления.НВД_ВидыОтгрузки.Перемещение Тогда	
			Если ОбщегоНазначения.ЕстьРеквизитОбъекта("НВД_СтатусДоставки", Источник.Метаданные()) Тогда
				Источник.НВД_СтатусДоставки = "";
			КонецЕсли;
			Если ОбщегоНазначения.ЕстьРеквизитОбъекта("НВД_Курьер", Источник.Метаданные()) Тогда
				Источник.НВД_Курьер = "";
			КонецЕсли;
			Если ОбщегоНазначения.ЕстьРеквизитОбъекта("НВД_АдресПартнера", Источник.Метаданные()) Тогда
				Источник.НВД_АдресПартнера = "";
			КонецЕсли;
			Если ОбщегоНазначения.ЕстьРеквизитОбъекта("НВД_ДопИнфоАдресПартнера", Источник.Метаданные()) Тогда
				Источник.НВД_ДопИнфоАдресПартнера = "";
			КонецЕсли;
			Если ОбщегоНазначения.ЕстьРеквизитОбъекта("НВД_ДопИнфоАдресМонтажа", Источник.Метаданные()) Тогда
				Источник.НВД_ДопИнфоАдресМонтажа = "";
			КонецЕсли;
			Если ОбщегоНазначения.ЕстьРеквизитОбъекта("НВД_КрайняяДатаОтгрузки", Источник.Метаданные()) Тогда
				Источник.НВД_КрайняяДатаОтгрузки = "";
			КонецЕсли;
			Если ОбщегоНазначения.ЕстьРеквизитОбъекта("НВД_КрайнееВремяОтгрузки", Источник.Метаданные()) Тогда
				Источник.НВД_КрайнееВремяОтгрузки = "";
			КонецЕсли;
			Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ОжидаемаяДатаОтгрузки", Источник.Метаданные()) Тогда
				Источник.ОжидаемаяДатаОтгрузки = "";
			КонецЕсли;
			Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ОжидаемоеВремяОтгрузки", Источник.Метаданные()) Тогда
				Источник.ОжидаемоеВремяОтгрузки = "";
			КонецЕсли;
			Если ОбщегоНазначения.ЕстьРеквизитОбъекта("АдресМонтажа", Источник.Метаданные()) Тогда
				Источник.АдресМонтажа = "";
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;	
	
	//проверки заполнения реквизитов
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("НВД_ВидОтгрузки", Источник.Метаданные()) Тогда
		Если НЕ ЗначениеЗаполнено(Источник.НВД_ВидОтгрузки) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен вид отгрузки", , , , Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("НВД_ВидОтгрузки", Источник.Метаданные()) Тогда
		Если Источник.НВД_ВидОтгрузки = Перечисления.НВД_ВидыОтгрузки.Доставка ИЛИ Источник.НВД_ВидОтгрузки = Перечисления.НВД_ВидыОтгрузки.ДоставкаСоСкладаПартнера Тогда
			Если ОбщегоНазначения.ЕстьРеквизитОбъекта("НВД_СтатусДоставки", Источник.Метаданные()) Тогда
				Если НЕ ЗначениеЗаполнено(Источник.НВД_СтатусДоставки) Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен статус доставки", , , , Отказ);
				КонецЕсли;
			КонецЕсли;
			Если ОбщегоНазначения.ЕстьРеквизитОбъекта("АдресМонтажа", Источник.Метаданные()) Тогда
				Если НЕ ЗначениеЗаполнено(Источник.АдресМонтажа) Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен адрес доставки", , , , Отказ);
				КонецЕсли;
			КонецЕсли;
			ЗаполененПериод = Истина;
			Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ОжидаемаяДатаОтгрузки", Источник.Метаданные()) Тогда
				Если НЕ ЗначениеЗаполнено(Источник.ОжидаемаяДатаОтгрузки) Тогда
					ЗаполененПериод = Ложь;
				КонецЕсли;
			КонецЕсли;
			Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ОжидаемоеВремяОтгрузки", Источник.Метаданные()) Тогда
				Если НЕ ЗначениеЗаполнено(Источник.ОжидаемоеВремяОтгрузки) Тогда
					ЗаполененПериод = Ложь;
				КонецЕсли;
			КонецЕсли;
			Если ОбщегоНазначения.ЕстьРеквизитОбъекта("НВД_КрайняяДатаОтгрузки", Источник.Метаданные()) Тогда
				Если НЕ ЗначениеЗаполнено(Источник.НВД_КрайняяДатаОтгрузки) Тогда
					ЗаполененПериод = Ложь;
				КонецЕсли;
			КонецЕсли;
			Если ОбщегоНазначения.ЕстьРеквизитОбъекта("НВД_КрайнееВремяОтгрузки", Источник.Метаданные()) Тогда
				Если НЕ ЗначениеЗаполнено(Источник.НВД_КрайнееВремяОтгрузки) Тогда
					ЗаполененПериод = Ложь;
				КонецЕсли;
			КонецЕсли;
			Если НЕ ЗаполененПериод Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен период отгрузки", , , , Отказ);
			КонецЕсли;
			
			Если Источник.НВД_ВидОтгрузки = Перечисления.НВД_ВидыОтгрузки.ДоставкаСоСкладаПартнера Тогда
				Если ОбщегоНазначения.ЕстьРеквизитОбъекта("НВД_АдресПартнера", Источник.Метаданные()) Тогда
					Если НЕ ЗначениеЗаполнено(Источник.НВД_АдресПартнера) Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен адрес партнёра", , , , Отказ);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры	

// Регистрирует объекты в узлах обмена ОбменПотолки.
//
// Параметры:
//  МассивУзлов - Массив - содержит узлы для регистрации изменений объекта;
//  Объект - ДокументОбъект - объект для которого регистрируются изменения.
//
Процедура ЗарегистрироватьИзмененияДляУзловОбмена(МассивУзлов, Объект)
	
	Если МассивУзлов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, Объект.Ссылка);
	
КонецПроцедуры

// Возвращает массив узлов плана обмена с учетом исключаемых.
//
// Параметры:
//  Исключения - Массив - массив узлов, для которых регистрацию изменений проводить не надо.
//
// Возвращаемое значение:
//  Массив - массив узлов для регистрации изменений.
//
Функция УзлыДляРегистрацииОбменУАТ(Исключения)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ОбменУАТ.Ссылка
	|ИЗ
	|	ПланОбмена.ОбменУАТ КАК ОбменУАТ
	|ГДЕ
	|	НЕ ОбменУАТ.ПометкаУдаления
	|	И НЕ ОбменУАТ.Ссылка В (&МассивИсключений)");
	
	Запрос.УстановитьПараметр("МассивИсключений", Исключения);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
КонецФункции

Процедура ЗарегистрироватьИзмененияОбменУАТ(Объект, ЭтоОбъект = Истина) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Исключения = Новый Массив;
	Исключения.Добавить(ПланыОбмена.ОбменУАТ.ЭтотУзел());
	
	Если ЭтоОбъект И Объект.ОбменДанными.Загрузка Тогда
		Исключения.Добавить(Объект.ОбменДанными.Отправитель);
	КонецЕсли;
	
	УзлыДляРегистрации = УзлыДляРегистрацииОбменУАТ(Исключения);
	
	ЗарегистрироватьИзмененияДляУзловОбмена(УзлыДляРегистрации, Объект);
	
КонецПроцедуры

// Возвращает структуру, содержащую имя таблицы для выборки и массив полей, которые нужно выбрать.
//
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных - объект метаданных, структуру описания которого требуется получить.
//  Изменения - Булево - признак того, что в качестве таблицы для выборки выступает таблица изменений.
//
// Возвращаемое значение:
//  Структура - структура, содержащая описание объекта метаданных, с полями:
//  	* ИмяКласса - Строка - имя класса объекта метаданных.
//      * ИмяОбъекта - Строка - имя объекта метаданных
//      * ИмяТаблицы - Строка - имя таблицы объекта.
//
Функция ОписаниеОбъекта(ОбъектМетаданных, Изменения) Экспорт
	
	Если Метаданные.Константы.Содержит(ОбъектМетаданных) Тогда
		ИмяКласса = "Константы";
		ИмяТаблицы = "Константы";
	ИначеЕсли Метаданные.Справочники.Содержит(ОбъектМетаданных) Тогда
		ИмяКласса = "Справочники";
		ИмяТаблицы = "Справочник." + ОбъектМетаданных.Имя;
	ИначеЕсли Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда
		ИмяКласса = "Документы";
		ИмяТаблицы = "Документ." + ОбъектМетаданных.Имя;
	ИначеЕсли Метаданные.РегистрыСведений.Содержит(ОбъектМетаданных) Тогда
		ИмяКласса = "РегистрыСведений";
		ИмяТаблицы = "РегистрСведений." + ОбъектМетаданных.Имя;
	КонецЕсли;	
	
	// Если требуется только выборка изменений, то выбирать необходимо по таблицам изменений.
	Если Изменения Тогда
		ИмяТаблицы = ИмяТаблицы + ".Изменения";
	КонецЕсли;
	
	СтруктураОписания = Новый Структура();
	СтруктураОписания.Вставить("ИмяКласса", ИмяКласса);
	СтруктураОписания.Вставить("ИмяОбъекта", ОбъектМетаданных.Имя);
	СтруктураОписания.Вставить("ИмяТаблицы", ИмяТаблицы);
	
	Возврат СтруктураОписания;
	
КонецФункции   

Процедура ДРБ_ЗарегистрироватьИзмененияДокументаОбменУАТПриЗаписи(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	//МетаданныеОбъекта = Источник.Метаданные();
	//
	//СтруктураОписанияОбъекта = ОписаниеОбъекта(МетаданныеОбъекта, Ложь);
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаявкаНаДоставку") Тогда
		
		// если не заполнен адрес доставки, то не регистрируем
		Если ЗначениеЗаполнено(Источник.АдресДоставки) Тогда
			ЗарегистрироватьИзмененияОбменУАТ(Источник, Ложь);
		КонецЕсли;	
		
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаказПокупателя") Тогда
		
		Запрос = новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЗаявкаНаДоставкуОснования.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаявкаНаДоставку.Основания КАК ЗаявкаНаДоставкуОснования
		|ГДЕ
		|	ЗаявкаНаДоставкуОснования.Основание = &Основание
		|	И НЕ ЗаявкаНаДоставкуОснования.Ссылка.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗаявкаНаДоставкуОснования.Ссылка.Дата";
		Запрос.УстановитьПараметр("Основание", Источник.Ссылка);
		
		ТЗЗаявокНаДоставку = Запрос.Выполнить().Выгрузить();
		Если ТЗЗаявокНаДоставку.Количество() > 0 Тогда
			// если не заполнен адрес доставки, то не регистрируем
			Если ЗначениеЗаполнено(ТЗЗаявокНаДоставку[0].Ссылка.АдресДоставки) Тогда
				ЗарегистрироватьИзмененияОбменУАТ(ТЗЗаявокНаДоставку[0].Ссылка.ПолучитьОбъект(), Ложь);
			КонецЕсли;	
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПреобразоватьНомерТелефонаДляПроверки(НомерТелефона)
	
	НомерТелефонаДляПроверки = НомерТелефона;
	
	НомерТелефонаДляПроверки = СтрЗаменить(НомерТелефонаДляПроверки, " ", "");
	НомерТелефонаДляПроверки = СтрЗаменить(НомерТелефонаДляПроверки, "+", "");
	НомерТелефонаДляПроверки = СтрЗаменить(НомерТелефонаДляПроверки, "(", "");
	НомерТелефонаДляПроверки = СтрЗаменить(НомерТелефонаДляПроверки, ")", "");
	НомерТелефонаДляПроверки = СтрЗаменить(НомерТелефонаДляПроверки, "-", "");
	НомерТелефонаДляПроверки = СтрЗаменить(НомерТелефонаДляПроверки, ",", Символы.ПС);
	
	Возврат НомерТелефонаДляПроверки;
	
КонецФункции

Процедура НВД_ПодпискаНаСобытиеПередЗаписьюСправочникаКонтрагенты(Источник, Отказ) Экспорт
	Телефоны = Источник.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип, Вид", Перечисления.ТипыКонтактнойИнформации.Телефон, Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента));
	
	//Если Телефоны.Количество() = 0 Тогда
	//	ОбщегоНазначения.СообщитьПользователю("Не заполнен контактный телефон!", , , , Отказ);
	//КонецЕсли;
	
	ТаблицаСообщений = Новый ТаблицаЗначений;
	Если Телефоны.Количество() > 0 Тогда
		МассивТелефонов = Новый Массив;
		Для Каждого Телефон Из Телефоны Цикл	
			МассивТелефонов.Добавить(Телефон.НомерТелефона);
		КонецЦикла;
		МассивНайденныхКонтрагентов = ПолучитьМассивКонтрагентовПоТелефону(Телефоны, Источник.Ссылка);
		Если МассивНайденныхКонтрагентов.Количество() > 0 Тогда
			ТаблицаСообщений.Колонки.Добавить("ТекстСообщения", Новый ОписаниеТипов("Строка"));
			ТаблицаСообщений.Колонки.Добавить("Контрагент"    , Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
			
			Для Каждого НайденныйКонтрагент Из МассивНайденныхКонтрагентов Цикл
				ТекстСообщения = "Номер телефона: '" + СтрСоединить(МассивТелефонов,", ") + "' уже привязан к контрагенту: '" + Строка(НайденныйКонтрагент) + "'";
				НоваяСтрока = ТаблицаСообщений.Добавить();
				НоваяСтрока.ТекстСообщения = ТекстСообщения;
				НоваяСтрока.Контрагент     = НайденныйКонтрагент; 
			КонецЦикла;
			Отказ = Истина;
		КонецЕсли;	
	КонецЕсли; 
	
	Если Телефоны.Количество() > 0 Тогда
		Если ТаблицаСообщений.Количество() > 0 Тогда
			ТекстСообщения = "Открыть контрагента можно двойным нажатием ЛКМ";
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Для каждого СтрокаСообщения Из ТаблицаСообщений Цикл
				ОбщегоНазначения.СообщитьПользователю(СтрокаСообщения.ТекстСообщения, СтрокаСообщения.Контрагент, , , );
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьМассивКонтрагентовПоТелефону(Телефоны, ИсключаемыйКонтрагент)
	
	Если Телефоны.Количество() = 0 Тогда 
		Возврат Новый Массив;
	КонецЕсли;	
	
	МассивТелефонов = Новый Массив;
	Для Каждого Телефон Из Телефоны Цикл
		НомерТелефона = Телефон.НомерТелефона;
		Если Лев(НомерТелефона,1) = "+" ИЛИ Лев(НомерТелефона,1) = "7" ИЛИ Лев(НомерТелефона,1) = "8" Тогда
			НомерТелефона = Прав(НомерТелефона, СтрДлина(НомерТелефона)-1);
			Если Лев(НомерТелефона,1) = "7" ИЛИ Лев(НомерТелефона,1) = "8" Тогда
				НомерТелефона = Прав(НомерТелефона, СтрДлина(НомерТелефона)-1);
			КонецЕсли;
		КонецЕсли;	
		МассивТелефонов.Добавить(ПреобразоватьНомерТелефонаДляПроверки(НомерТелефона));
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтрагентыКонтактнаяИнформация.Ссылка КАК Ссылка,
	|	КонтрагентыКонтактнаяИнформация.НомерСтроки КАК НомерСтроки,
	|	КонтрагентыКонтактнаяИнформация.Тип КАК Тип,
	|	КонтрагентыКонтактнаяИнформация.Вид КАК Вид,
	|	КонтрагентыКонтактнаяИнформация.Представление КАК Представление,
	|	КонтрагентыКонтактнаяИнформация.ЗначенияПолей КАК ЗначенияПолей,
	|	КонтрагентыКонтактнаяИнформация.Страна КАК Страна,
	|	КонтрагентыКонтактнаяИнформация.Регион КАК Регион,
	|	КонтрагентыКонтактнаяИнформация.Город КАК Город,
	|	КонтрагентыКонтактнаяИнформация.АдресЭП КАК АдресЭП,
	|	КонтрагентыКонтактнаяИнформация.ДоменноеИмяСервера КАК ДоменноеИмяСервера,
	|	ПОДСТРОКА(КонтрагентыКонтактнаяИнформация.НомерТелефона, 2, 13) КАК НомерТелефона,
	|	КонтрагентыКонтактнаяИнформация.НомерТелефонаБезКодов КАК НомерТелефонаБезКодов,
	|	КонтрагентыКонтактнаяИнформация.ВидДляСписка КАК ВидДляСписка,
	|	КонтрагентыКонтактнаяИнформация.Значение КАК Значение
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|ГДЕ
	|	КонтрагентыКонтактнаяИнформация.Тип = &Тип
	|	И КонтрагентыКонтактнаяИнформация.Вид = &Вид
	|	%ИсключаемыйКонтрагент%
	|	И (%СтрокаПоиска%)";
	
	
	А = 1;
	СтрокаПоиска = "";
	Для Каждого Телефон Из МассивТелефонов Цикл
		Если А <> 1 Тогда
			СтрокаПоиска = СтрокаПоиска + " ИЛИ ";
		КонецЕсли;	
		СтрокаПоиска = СтрокаПоиска + "ПОДСТРОКА(КонтрагентыКонтактнаяИнформация.НомерТелефона, 2, 13) ПОДОБНО &Телефон" + А;                            
		Запрос.УстановитьПараметр("Телефон" + А, Телефон);
		А = А + 1;
	КонецЦикла;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%СтрокаПоиска%", СтрокаПоиска);
	
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента);
	
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон); 
	
	Если ЗначениеЗаполнено(ИсключаемыйКонтрагент) Тогда             
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ИсключаемыйКонтрагент%", "И КонтрагентыКонтактнаяИнформация.Ссылка <> &ИсключаемыйКонтрагент");
		Запрос.УстановитьПараметр("ИсключаемыйКонтрагент", ИсключаемыйКонтрагент);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ИсключаемыйКонтрагент%", "");
	КонецЕсли;	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Результат = РезультатЗапроса.Выгрузить();
	
	Если Результат.Количество() = 0 Тогда 
		
		Возврат Новый Массив;
		
	Иначе
		
		Возврат Результат.ВыгрузитьКолонку("Ссылка");
		
	КонецЕсли;
	
КонецФункции

Процедура НВД_ПриЗаписиПроверитьНаПустуюТЧОбработкаПроведения(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ТоварыЗаполнены = Ложь;   
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Источник, "Товары") Тогда
		Если Источник.Товары.Количество() > 0 Тогда
			ТоварыЗаполнены = Истина;
		КонецЕсли;	
	КонецЕсли;
	
	МатериалыЗаполнены = Ложь;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Источник, "Материалы") Тогда
		Если Источник.Материалы.Количество() > 0 Тогда
			МатериалыЗаполнены = Истина;
		КонецЕсли;	
	КонецЕсли;
	
	УслугиЗаполнены = Ложь;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Источник, "Услуги") Тогда
		Если Источник.Услуги.Количество() > 0 Тогда
			УслугиЗаполнены = Истина;
		КонецЕсли;	
	КонецЕсли; 
	
	Если НЕ ТоварыЗаполнены И НЕ МатериалыЗаполнены И НЕ УслугиЗаполнены Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если Отказ Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнены табличные части в документе", , , , Отказ);
	КонецЕсли;
	
КонецПроцедуры   

Процедура НВД_ПриПроведенииЗаказаИзменитьСтатусЗаявкиНаДоставку(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	Если ТипЗнч(Источник)<> Тип("ДокументОбъект.ЗаказПокупателя") Тогда
		Возврат;
	КонецЕсли;
		
	ЗаявкаНаДоставку = ПолучитьЗаявкуНаДоставку(Источник.Ссылка);
	
	Если ЗаявкаНаДоставку = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийСтатусЗаказаПокупателя = Источник.ТекущийСтатус;
	ТекущийСтатусСборкиЗаказаПокупателя = Источник.СтатусСборки;
	ТекущийСтатусЗаявкиНаДоставку = ЗаявкаНаДоставку.Результат; 
	
	Если ТекущийСтатусЗаявкиНаДоставку = Справочники.СтатусыЗаявокНаДоставку.Отказ Тогда
		//доставки не будет, она не нужна, клиент заберет сам или уже забрал
		Возврат;
	КонецЕсли;	
	
	НовыйСтатусЗаявкиНаДоставку = Неопределено;
	ОтправленоДата = Неопределено;
	
	Если ТекущийСтатусЗаказаПокупателя = Справочники.СтатусыЗаказовПокупателей.ВРаботе И ТекущийСтатусСборкиЗаказаПокупателя = Справочники.СтатусыСборкиЗаказов.СобранПолностью Тогда
		НовыйСтатусЗаявкиНаДоставку = Справочники.СтатусыЗаявокНаДоставку.Подготовлено;
	ИначеЕсли ТекущийСтатусЗаказаПокупателя = Справочники.СтатусыЗаказовПокупателей.Выполнен Тогда
		НовыйСтатусЗаявкиНаДоставку = Справочники.СтатусыЗаявокНаДоставку.Отправлено;
		ОтправленоДата = ТекущаяДата();  
	ИначеЕсли ТекущийСтатусЗаказаПокупателя = Справочники.СтатусыЗаказовПокупателей.Отменен Тогда	
		НовыйСтатусЗаявкиНаДоставку = Справочники.СтатусыЗаявокНаДоставку.Отказ;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НовыйСтатусЗаявкиНаДоставку) И НовыйСтатусЗаявкиНаДоставку <> ТекущийСтатусЗаявкиНаДоставку И ТекущийСтатусЗаявкиНаДоставку <> Справочники.СтатусыЗаявокНаДоставку.Доставлено Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		Попытка
			ЗаявкаНаДоставку.Результат = НовыйСтатусЗаявкиНаДоставку;
			Если ЗначениеЗаполнено(ОтправленоДата) Тогда
				ЗаявкаНаДоставку.ОтправленоДата = ОтправленоДата;
			КонецЕсли;	
			ЗаявкаНаДоставку.ОбменДанными.Загрузка = Истина;
			ЗаявкаНаДоставку.Записать();
		Исключение
			Ошибка = ИнформацияОбОшибке();
    		ОшибкаКратко = КраткоеПредставлениеОшибки(Ошибка); 
			ОбщегоНазначения.СообщитьПользователю(ОшибкаКратко);					
		КонецПопытки;	
	
		УстановитьПривилегированныйРежим(Ложь); 
		
	КонецЕсли;	
		
КонецПроцедуры 

Функция ПолучитьЗаявкуНаДоставку(ЗаказПокупателя)
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЗаявкаНаДоставкуОснования.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаявкаНаДоставку.Основания КАК ЗаявкаНаДоставкуОснования
	|ГДЕ
	|	ЗаявкаНаДоставкуОснования.Основание = &Основание
	|	И НЕ ЗаявкаНаДоставкуОснования.Ссылка.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаявкаНаДоставкуОснования.Ссылка.Дата";
	Запрос.УстановитьПараметр("Основание", ЗаказПокупателя);
	
	ТЗЗаявокНаДоставку = Запрос.Выполнить().Выгрузить();
	Если ТЗЗаявокНаДоставку.Количество() > 0 Тогда
		Возврат ТЗЗаявокНаДоставку[0].Ссылка.ПолучитьОбъект();	
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции
